#include <stdio.h>

int main_array(void) {
	// 陥託据 壕伸 Multidimenasional Array
	
	int i;
	// け

	int arr[5];	
	// けけけけけ
	// arr[0][1][2][3][4]

	int arr2[2][5];
	/*
	けけけけけ
	けけけけけ
	*/
	// arr2[0][0], arr2[0][1], arr2[0][2], arr2[0][3], arr2[0][4]
	// arr2[1][0], arr2[1][1], arr2[1][2], arr2[1][3], arr2[1][4]
	
	int arr3[4][2];
	/*
	けけ
	けけ
	けけ
	けけ
	*/
	// arr3[0][0], arr3[0][1]
	// arr3[1][0], arr3[1][1]
	// arr3[2][0], arr3[2][1]
	// arr3[3][0], arr3[3][1]

	int arr4[3][3][3];
	/*
	けけけ
	けけけ
	けけけ

	けけけ
	けけけ
	けけけ

	けけけ
	けけけ
	けけけ
	*/
	// arr4[0][0][0], arr4[0][0][1], arr4[0][0][2]
	// arr4[0][1][0], arr4[0][1][1], arr4[0][1][2]
	// arr4[0][2][0], arr4[0][2][1], arr4[0][2][2]

	// arr4[1][0][0], arr4[1][0][1], arr4[1][0][2]
	// arr4[1][1][0], arr4[1][1][1], arr4[1][1][2]
	// arr4[1][2][0], arr4[1][2][1], arr4[1][2][2]

	// arr4[2][0][0], arr4[2][0][1], arr4[2][0][2]
	// arr4[2][1][0], arr4[2][1][1], arr4[2][1][2]
	// arr4[2][2][0], arr4[2][2][1], arr4[2][2][2]

	int arr5[5] = { 1,2,3,4,5 };
	int arr6[2][5] = { 
		{ 1,2,3,4,5 } , 
		{ 1,2,3,4,5 } 
	};
	int arr7[4][2] = { 
		{1,2}, 
		{3,4}, 
		{5,6}, 
		{7,8}
	};

	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 2; j++) {
			printf("2託据 壕伸 (%d, %d)税 葵 : %d\n", i, j, arr7[i][j]);
		}
		printf("\n");
	}

	int arr8[3][3][3] = { 
		{
			{1,2,3}, 
			{4,5,6}, 
			{7,8,9}
		}, 
		{
			{10,11,12}, 
			{13,14,15}, 
			{16,17,18}
		} , 
		{
			{19,20,21}, 
			{22,23,24}, 
			{25,26,27}
		} 
	};
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			for (int k = 0; k < 3; k++) {
				printf("3託据 壕伸 (%d, %d, %d)税 葵 : %d\n", i, j, k, arr8[i][j][k]);
			}
			printf("\n");
		}
	}


	return 0;
}